# @package _group_._name_
backend: tensorflow
class_name: Sequential
config:
  layers:
  # - class_name: InputLayer
  #   config:
  #     batch_input_shape:
  #     - null
  #     - ${layer_sizes.pre_encoding_size}
  #     dtype: float32
  #     name: input_5
  #     ragged: false
  #     sparse: false
  - class_name: Dense
    config:
      activation: leaky_relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_10
      trainable: true
      units: 8192
      use_bias: true
  - class_name: Reshape
    config:
      dtype: float32
      name: reshape
      target_shape:
      - 8
      - 16
      - 64
      trainable: true
  - class_name: Conv2DTranspose
    config:
      activation: leaky_relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate:
      - 1
      - 1
      dtype: float32
      filters: 64
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size:
      - 4
      - 4
      name: conv2d_transpose
      output_padding: null
      padding: same
      strides:
      - 2
      - 2
      trainable: true
      use_bias: true
  - class_name: Conv2DTranspose
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate:
      - 1
      - 1
      dtype: float32
      filters: 3
      groups: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      kernel_size:
      - 4
      - 4
      name: conv2d_transpose_1
      output_padding: null
      padding: same
      strides:
      - 2
      - 2
      trainable: true
      use_bias: true
  name: sequential_4
keras_version: 2.4.0
